raindrop_example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.02;

vertices
(
    (0 -10 0)
    (2 -10 0)
    (3 -10 0)
    (5 -10 0)
    (0 0 0)
    (2 0 0)
    (3 0 0)
    (5 0 0)
    (0 -10 0.1)
    (2 -10 0.1)
    (3 -10 0.1)
    (5 -10 0.1)
    (0 0 0.1)
    (2 0 0.1)
    (3 0 0.1)
    (5 0 0.1)

);

blocks
(
    hex (0 1 5 4 8 9 13 12) (25 500 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (250 500 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (25 500 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type aptch;
        faces
        (
            (0 4 12 8)
        );
    }
    right
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }
    bot
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
