raindrop_example/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0000001;

boundaryField
{
    left
    {
        type            inletOutlet;
        inletValue      uniform 0.0000001;
        value           uniform 0.0000001;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 0.0000001;
        value           uniform 0.0000001;
    }
    bot
    {
        type            inletOutlet;
        inletValue      uniform 0.0000001;
        value           uniform 0.0000001;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0000001;
        value           uniform 0.0000001;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
